let strings = '边面里下来去起嗽方道明力话友是处煩亮情欢睛事股识经分楚心生意人涂闹候服牌戚姐头花西亲计白快少们系到烦难夫害书问寸监付误家食发法星袋务应实神度声忽晨置负萄酬泼指拾磨致顾他唐复就形拇屈耐议扮农同数辑指试场蚤疾靠';

let words = {
  '上': ['不上', '关上', '谈不上', '晚上', '早上', '合上 ', '说不上', '身上', '地上'],
  '个': ['几个', '一个'],
  '愤': ['气愤'],
  '赏': ['欣赏'],
  '娘': ['娘娘腔', '姑娘'],
  '坏': ['破坏'],
  '烂': ['灿烂'],
  '卜': ['胡萝卜', '萝卜', '胡萝卜素'],
  '鮮': ['新鮮'],
  '不': ['说不上 ', '事不过三', '站不住脚', '赔不是', '搞不懂', '说不上', '一动不动', '可不是', '会不会', '分不出'],
  '爷': ['老大爷', '大爷', '大少爷', '老爷', '姥爷'],
  '量': ['质量', '力量', '商量', '掂量'],
  '训': ['教训'],
  '疾': ['残疾'],
  '八': ['王八'],
  '记': ['总书记', '书记', '书记处'],
  '腿': ['胳膊扭不过大腿'],
  '放': ['寄放'],
  '具': ['具具'],
  '朵': ['耳朵'],
  '狸': ['小狐狸', '狐狸'],
  '防': ['提防'],
  '巴': ['哑巴'],
  '随': ['随随便便'],
  '作': ['做作'],
  '盆': ['澡盆'],
  '稽': ['滑稽'],
  '结': ['结结实实'],
  '萄': ['葡萄酒', '一颗葡萄'],
  '嘛': ['喇嘛'],
  '嗦': ['啰嗦', '罗嗦'],
  '唆': ['啰唆', '罗嗦'],
  '望': ['拜望'],
  '钟': ['编钟'],
  '司': ['官司', '上司'],
  '缝': ['裁缝'],
  '丁': ['补丁'],
  '性': ['记性'],
  '腐': ['豆腐', '卖豆腐', '麻婆豆腐'],
  '悠': ['忽悠'],
  '番': ['翻番'],
  '絮': ['絮絮叨叨'],
  '娃': ['娃娃', '娃娃音'],
  '臂': ['胳臂'],
  '拉': ['刮拉'],
  '瘩': ['疙瘩', '起鸡皮疙瘩'],
  '篷': ['帐篷'],
  '乎': ['满不在乎', '在乎'],
  '在': ['自在'],
  '开': ['让开'],
  '数': ['着数', '著数'],
  '道': ['知道了'],
  '罕': ['稀罕'],
  '李': ['行李'],
  '看': ['给我看看', '看看'],
  '呼': ['打招呼'],
  '思': ['心思', '意思是'],
  '起': ['听起来顺耳'],
  '来': ['听起来顺耳', '近来吧'],
  '笼': ['灯笼'],
  '糊': ['含糊'],
  '榴': ['石榴'],
  '钱': ['工钱', '饭钱', '价钱'],
  '騰': ['折騰'],
  '膊': ['胳膊'],
  '傅': ['師傅', '一位师傅'],
  '宜': ['便宜'],
  '瑰': ['玫瑰花茶', '玫瑰', '玫瑰花', '玫瑰花儿'],
  '隔': ['阻隔'],
  '死': ['僵死'],
  '慌': ['闷得慌'],
  '麻': ['芝麻糖', '芝麻'],
  '气': ['哥儿们义气', '义气', '不客气', '客气', '脾气'],
  '士': ['护士', '持证护士', '注册护士', '护士助理', '道士'],
  '午': ['晌午'],
  '子': ['竿子'],
  '手': ['扳手', '把手', '帮手', '一个把手'],
  '和': ['软和', '暖和'],
  '文': ['斯文'],
  '駝': ['駱駝'],
  '毛': ['白眉毛', '眉毛'],
  '达': ['蹦达'],
  '匠': ['锁匠'],
  '析': ['以上分析', '分析'],
  '维': ['恭维'],
  '剔': ['挑剔'],
  '生': ['学生联合会', '学生', '大学生'],
  '璃': ['安全玻璃', '玻璃'],
  '哧': ['呼哧呼哧', '呼哧'],
  '见': ['瞅见', '提意见', '意见'],
  '驼': ['野骆驼', '骆驼'],
  '泛': ['活泛劲儿', '活泛'],
  '老': ['老老实实'],
  '行': ['德行'],
  '屉': ['锁抽屉', '抽屉'],
  '扭': ['扭扭捏捏'],
  '动': ['响动'],
  '灵': ['机灵'],
  '湖': ['江湖', '走江湖'],
  '榔': ['槟榔'],
  '莉': ['茉莉', '茉莉花茶'],
  '识': ['知识', '知识新贵', '意识形态', '知识性'],
  '鼓': ['鼓鼓囊囊'],
  '息': ['出息'],
  '鸯': ['鸳鸯', '鸳鸯锅'],
  '头': ['木头人'],
  '路': ['门路'],
  '使': ['差使'],
  '字': ['名字'],
  '一': ['比一比', '让我想一想'],
  '人': ['别人'],
  '担': ['担担面'],
  '吧': ['贴吧'],
  '辑': ['数学逻辑'],
  '成': ['收成'],
  '女': ['闺女'],
  '米': ['虾米'],
  '诉': ['告诉'],
  '水': ['露水'],
  '划': ['比划'],
  '歌': ['扭秧歌', '秧歌'],
  '画': ['比画'],
  '里': ['那里'],
  '化': ['造化'],
  '悄': ['悄悄话'],
  '寸': ['分寸'],
  '甲': ['指甲钳'],
  '书': ['秘书'],
  '户': ['窗户'],
  '买': ['买卖'],
  '用': ['费用', '一笔费用'],
  '服': ['佩服'],
  '理': ['道理'],
  '菇': ['蘑菇'],
  '婿': ['女婿'],
  '卖': ['买卖'],
  '物': ['怪物'],
  '神': ['精神'],
  '晨': ['早晨'],
  '去': ['出去', '過去'],
  '蔗': ['甘蔗'],
  '等': ['等等'],
  '靜': ['動靜'],
  '候': ['時候'],
  '白': ['明白', '不明白'],
  '賣': ['買賣'],
  '係': ['關係網'],
  '婆': ['老婆'],
};

/**
 * @method getStrings
 * @returns {Array}
 */
function getStrings () {
  return strings.split('');
}

/**
 * @method getWords
 * @param {String} character
 * @returns {Object}
 */
function getWords (character) {
  return words[character] || [];
}

/**
 * @method isWimp
 * @param {String} character
 * @param {String} word
 * @param {Number} index
 * @returns {Boolean}
 */
function isWimp (character, word, index) {
  if (word.length > 1) {
    if (index + 1 === word.length) {
      if (this.getStrings().indexOf(character) > -1) {
        return true;
      }
    }
    if (this.getWords(character).indexOf(word) > -1) {
      return true;
    }
  }
  return false;
}

module.exports = {
  getStrings: getStrings,
  getWords: getWords,
  isWimp: isWimp,
};
